 /*********************************************************************
*                                                                     *
*           TFT液晶屏显示图片                                         *
*              （  普中科技  ）                                       *
*                                                                     *
* 实验目的：1.掌握TFT彩屏驱动程序的编写、							  *
            2.学会运用取字模软件应用（取图片数组）					  *
			3.学会怎样处理字模数组数据                                *
*                                                                     *
*实验现象：彩屏中显示4个相同的图片                                    *
*                                                                     *
***********************************************************************/

#include <reg52.h>
#include <intrins.h>

#include "LCD.h"

char code reserve[3]_at_ 0x3b; //保留0x3b开始的3个字节

/**********************************************************

  主函数

**********************************************************/
void main(void)
{  
   P2 = 0xff;
   P0 = 0xff;
    
    LCD_init();
    LCD_clear(6);

    pic_play(7,61,8,74);
    pic_play(68,122,8,74);
    pic_play(7,61,82,148);
    pic_play(68,122,82,148);
 
   while(1)	;
}

/*********************************************************/
