/*******************************************************************************
*  标题:                  试验动静LED灯——实现动态控制                        *
*																			   *
*  连接方法：P0与J12 用8PIN排线连接	 J14短路帽短接                             *
********************************************************************************
*                         	       										       *
* 请学员认真消化本例程，用单片机脚直接控制和138译码器控制数码管                *
********************************************************************************/


#include <reg51.h> 
#include <intrins.h>

sbit LED8_1=P1^1;   //j14接在P1.1上

void delay(unsigned int i);      //函数声名

char DelayCNT;
char LED;
 
main()
{  
   LED = 0x01;  
   DelayCNT=0;

  while(1)
  {	 
     if(++DelayCNT>=10)	  //点亮动静LED灯速度控制
	 {
	 	DelayCNT=0;
		LED = LED << 1;	    // 左移
		if(LED==0) LED = 1;	// 移位后，后面的位为高电平
	 }
 	  P0 =LED; 
	  LED8_1=0;
	  delay(1000);  //调用延时程序
   }   
}	

void delay(unsigned int i)
{
    char j;
    for(i; i > 0; i--)
        for(j = 200; j > 0; j--);
}


