																 
/********************************************************************************
*  描述:                                                                        *    
*        矩阵键盘1602液晶显示键值                                               *    
*   连接方法：JP8（P1） 与JP4（矩阵键盘接口） 连接                              *    
*         矩阵键盘定义：                                                        *
*         P1.1-P1.4为列线,P1.4-P1.7为行线                                       *    
*         喇叭接P1.5口  矩阵键盘P1口，                                          *    
*  注意：请将JP165短路冒断开                                                    *                            
*********************************************************************************/
#include <reg52.h>
#include <intrins.h>
#include"4x3.h"

uchar  temp;
uchar  key;                //键顺序吗
uchar  dis_buf;            //显示缓存


#define delayNOP(); {_nop_();_nop_();_nop_();_nop_();};

/*************************************************************/
/*                                                           */
/* 延时子程序                                                */
/*                                                           */
/*************************************************************/

void  delay(uchar x)
{ uchar j;
    while((x--)!=0)
    { for(j=0;j<125;j++)
         {;}
    }
}



/*************************************************************/
/*                                                           */
/* 键扫描子程序  (4*3 的矩阵) P1.4 P1.5 P1.6 P1.7为行        */
/*							  P1.1 P1.2 P1.3为列             */
/*                            								 */
/*************************************************************/

 void  keyscan(void)
 { 	temp = 0;
    P1=0xF0;                 //高四位输入   行为高电平  列为低电平
    delay(1);
	temp=P1;                 //读P1口 
    temp=temp&0xF0;			 //屏蔽低四位
    temp=~((temp>>4)|0xF0);	  
    if(temp==1)	  // p1.4 被拉低
        key=0;
    else if(temp==2)   // p1.5 被拉低
        key=1;
    else if(temp==4)   // p1.6 被拉低
        key=2;
    else if(temp==8)   // p1.7 被拉低
         key=3;
    else
        key=16;
        
    P1=0x0F;                //低四位输入  列为高电平 行为低电平
    delay(1);
	temp=P1;                //读P1口       
    temp=temp&0x0F;
    temp=~(temp|0xF0);
    if(temp==2)		   // p1.1  被拉低
        key=key+0;
    else if(temp==4)   // p1.2  被拉低
        key=key+4;
    else if(temp==8)	// p1.3  被拉低
        key=key+8;
    else
        key=16;	 
    	
     dis_buf = key;	             //键值入显示缓存
     dis_buf = dis_buf & 0x0f;
 
	 if(dis_buf>9)               //转换为ASCII码
      dis_buf = dis_buf+0x37;
     else
	  dis_buf = dis_buf+0x30;
 }

/*************************************************************/
/*                                                           */
/*判断键是否按下                                             */
/*                                                           */
/*************************************************************/

 void  keydown(void)
 {  
  	P1=0xF0;
	if(P1!=0xF0)  //判断按键是否按下 如果按钮按下 会拉低P1其中的一个端口
	{
	  keyscan();
    }
 }

