/*********************************************************************************
*  标题:                  RS232串口通信试验(接收)                                *     
*																				 *
*  1.通过本例程了解串口的基本原理及使用 ,理解并掌握对串口进行初始化				 *
*																				 *
*   2.请使用串口调试助手（Baud 4800、数据位8、停止位1、效验位无）做为上位机发给单片机，
*     如果在字符数字发送框发0X00蜂铃器就会叫，如果发0xff蜂铃器就停叫。 			 *
*                           	                                                 *     
* 请学员认真消化本例程，学会用C语言操作串口                      	             *     
***********************************************************************************/

#include <REG52.H>
#include <stdio.h>
sbit BEEP = P1^4;
unsigned char b;

void main (void) {


        SCON = 0x50;      //REN=1允许串行接受状态，串口工作模式1    	       	   
	    TMOD|= 0x20;      //定时器工作方式2                    
		PCON|= 0x80;                                                          
		//TH1  = 0xFD;     //baud*2  /* reload value 19200、数据位8、停止位1。效验位无 (11.0592) 
		TH1 = 0xF3;		// //baud*2  /*  波特率4800、数据位8、停止位1。效验位无 (12M)
    	TL1 = 0xF3;         
		TR1  = 1;                                                             
		ES   = 1;        //开串口中断                  
		EA   = 1;        // 开总中断 
		BEEP=1;
	   // IE = 0x0;
   
	while(1)
    { 
	
	  if (RI)       //RI接受中断标志
   	  {  RI=0; 	    //清除RI接受中断标志
	     b=SBUF;	//SUBF接受/发送缓冲器
       }
	 BEEP=b;
  
  
 }
 
}
