;/*******************************************************************************
;*  标题:                  试验定时中断1使 蜂铃器发声(汇编语言)                 *
;*																			    *
;*  连接方法：P1.5       蜂铃器                                                 *
;********************************************************************************
;*                         	       										        *
;* 请学员认真消化本例程，熟练定时中断1的编程                                    *
;********************************************************************************/ 

 
 ORG   0000H
 LJMP  MAIN
 ORG   001BH   ;定时中断入口地址
 LJMP  INSER
 ORG   0030H

 MAIN: MOV TMOD ,  #10H
       MOV TH1  ,  #04CH   ;装入定时器初值
	   MOV TL1  ,  #000H
	   SETB EA			;打开总中断
	   SETB ET1			;允许定时器/计数器1 中断
	   SETB TR1			;开启定时器/计数器1 中断
HERE:  SJMP  HERE		 ;原地踏步

       ORG  0200H
INSER: MOV TH1  ,  #04CH
	   MOV TL1  ,  #000H
	   INC A
	   CJNE A , #20 , LOOP	;每隔20*50MS 一秒发声
	   CPL P1.5
	   MOV  A , #00H
LOOP:  RETI
	   END  



